GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_tsi.h
/**
  *******************************************************************************************************
  * @file    fm33fh0xx_fl_tsi.h
  * @author  FMSH Application Team
  * @brief   Head file of TSI FL Module
  *******************************************************************************************************
  * @attention    
  * Copyright 2024 SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICRO.)
  *        
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met: 
  *    
  * 1. Redistributions of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors 
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *    
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS"AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE   
  * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
  * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
  * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT   
  * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
  * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.    
  *
  ****************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FH0XX_FL_TSI_H
#define __FM33FH0XX_FL_TSI_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fh0xx_fl_def.h"
/** @addtogroup FM33FH0XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup TSI_FL_ES_INIT TSI Exported Init structures
  * @{
  */

/**
  * @brief FL TSI Init Sturcture definition
  */
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup TSI_FL_Exported_Constants TSI Exported Constants
  * @{
  */

#define    TSI_ISR_SEQF_Pos                                       (2U)
#define    TSI_ISR_SEQF_Msk                                       (0x1U << TSI_ISR_SEQF_Pos)
#define    TSI_ISR_SEQF                                           TSI_ISR_SEQF_Msk

#define    TSI_ISR_CHF_Pos                                        (1U)
#define    TSI_ISR_CHF_Msk                                        (0x1U << TSI_ISR_CHF_Pos)
#define    TSI_ISR_CHF                                            TSI_ISR_CHF_Msk

#define    TSI_ISR_RCUF_Pos                                       (0U)
#define    TSI_ISR_RCUF_Msk                                       (0x1U << TSI_ISR_RCUF_Pos)
#define    TSI_ISR_RCUF                                           TSI_ISR_RCUF_Msk

#define    TSI_IER_SEQ_IE_Pos                                     (2U)
#define    TSI_IER_SEQ_IE_Msk                                     (0x1U << TSI_IER_SEQ_IE_Pos)
#define    TSI_IER_SEQ_IE                                         TSI_IER_SEQ_IE_Msk

#define    TSI_IER_CH_IE_Pos                                      (1U)
#define    TSI_IER_CH_IE_Msk                                      (0x1U << TSI_IER_CH_IE_Pos)
#define    TSI_IER_CH_IE                                          TSI_IER_CH_IE_Msk

#define    TSI_IER_RCU_IE_Pos                                     (0U)
#define    TSI_IER_RCU_IE_Msk                                     (0x1U << TSI_IER_RCU_IE_Pos)
#define    TSI_IER_RCU_IE                                         TSI_IER_RCU_IE_Msk

#define    TSI_RXSSR_RXSSR_Pos                                    (0U)
#define    TSI_RXSSR_RXSSR_Msk                                    (0x3fU << TSI_RXSSR_RXSSR_Pos)
#define    TSI_RXSSR_RXSSR                                        TSI_RXSSR_RXSSR_Msk

#define    TSI_TXSSR_TXSSR_Pos                                    (0U)
#define    TSI_TXSSR_TXSSR_Msk                                    (0x3fU << TSI_TXSSR_TXSSR_Pos)
#define    TSI_TXSSR_TXSSR                                        TSI_TXSSR_TXSSR_Msk

#define    TSI_CFGR_SMPL_SIZE_Pos                                 (28U)
#define    TSI_CFGR_SMPL_SIZE_Msk                                 (0xfU << TSI_CFGR_SMPL_SIZE_Pos)
#define    TSI_CFGR_SMPL_SIZE                                     TSI_CFGR_SMPL_SIZE_Msk

#define    TSI_CFGR_TSI_MOD_Pos                                   (22U)
#define    TSI_CFGR_TSI_MOD_Msk                                   (0x3U << TSI_CFGR_TSI_MOD_Pos)
#define    TSI_CFGR_TSI_MOD                                       TSI_CFGR_TSI_MOD_Msk

#define    TSI_CFGR_CHCFG_WAIT_Pos                                (20U)
#define    TSI_CFGR_CHCFG_WAIT_Msk                                (0x1U << TSI_CFGR_CHCFG_WAIT_Pos)
#define    TSI_CFGR_CHCFG_WAIT                                    TSI_CFGR_CHCFG_WAIT_Msk

#define    TSI_CFGR_TRIG_SEL_Pos                                  (12U)
#define    TSI_CFGR_TRIG_SEL_Msk                                  (0xfU << TSI_CFGR_TRIG_SEL_Pos)
#define    TSI_CFGR_TRIG_SEL                                      TSI_CFGR_TRIG_SEL_Msk

#define    TSI_CFGR_AVG_ORDER_Pos                                 (8U)
#define    TSI_CFGR_AVG_ORDER_Msk                                 (0xfU << TSI_CFGR_AVG_ORDER_Pos)
#define    TSI_CFGR_AVG_ORDER                                     TSI_CFGR_AVG_ORDER_Msk

#define    TSI_CFGR_AVG_EN_Pos                                    (7U)
#define    TSI_CFGR_AVG_EN_Msk                                    (0x1U << TSI_CFGR_AVG_EN_Pos)
#define    TSI_CFGR_AVG_EN                                        TSI_CFGR_AVG_EN_Msk

#define    TSI_CFGR_TMOD_Pos                                      (5U)
#define    TSI_CFGR_TMOD_Msk                                      (0x1U << TSI_CFGR_TMOD_Pos)
#define    TSI_CFGR_TMOD                                          TSI_CFGR_TMOD_Msk

#define    TSI_CFGR_SHIELD_EN_Pos                                 (4U)
#define    TSI_CFGR_SHIELD_EN_Msk                                 (0x1U << TSI_CFGR_SHIELD_EN_Pos)
#define    TSI_CFGR_SHIELD_EN                                     TSI_CFGR_SHIELD_EN_Msk

#define    TSI_CFGR_SEN_Pos                                       (0U)
#define    TSI_CFGR_SEN_Msk                                       (0x1U << TSI_CFGR_SEN_Pos)
#define    TSI_CFGR_SEN                                           TSI_CFGR_SEN_Msk

#define    TSI_CR_STOP_Pos                                        (2U)
#define    TSI_CR_STOP_Msk                                        (0x1U << TSI_CR_STOP_Pos)
#define    TSI_CR_STOP                                            TSI_CR_STOP_Msk

#define    TSI_CR_SCAN_CON_Pos                                    (1U)
#define    TSI_CR_SCAN_CON_Msk                                    (0x1U << TSI_CR_SCAN_CON_Pos)
#define    TSI_CR_SCAN_CON                                        TSI_CR_SCAN_CON_Msk

#define    TSI_CR_START_Pos                                       (0U)
#define    TSI_CR_START_Msk                                       (0x1U << TSI_CR_START_Pos)
#define    TSI_CR_START                                           TSI_CR_START_Msk

