GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_tsi.h
#define    TSI_RAWCNTR_TXSID_Pos                                  (24U)
#define    TSI_RAWCNTR_TXSID_Msk                                  (0x3fU << TSI_RAWCNTR_TXSID_Pos)
#define    TSI_RAWCNTR_TXSID                                      TSI_RAWCNTR_TXSID_Msk

#define    TSI_RAWCNTR_RXSID_Pos                                  (16U)
#define    TSI_RAWCNTR_RXSID_Msk                                  (0x3fU << TSI_RAWCNTR_RXSID_Pos)
#define    TSI_RAWCNTR_RXSID                                      TSI_RAWCNTR_RXSID_Msk

#define    TSI_RAWCNTR_RAW_COUNT_Pos                              (0U)
#define    TSI_RAWCNTR_RAW_COUNT_Msk                              (0xffffU << TSI_RAWCNTR_RAW_COUNT_Pos)
#define    TSI_RAWCNTR_RAW_COUNT                                  TSI_RAWCNTR_RAW_COUNT_Msk

#define    TSI_CCR_SCAN_ZERO_Pos                                  (24U)
#define    TSI_CCR_SCAN_ZERO_Msk                                  (0x7fU << TSI_CCR_SCAN_ZERO_Pos)
#define    TSI_CCR_SCAN_ZERO                                      TSI_CCR_SCAN_ZERO_Msk

#define    TSI_CCR_SCAN_IDLE_Pos                                  (16U)
#define    TSI_CCR_SCAN_IDLE_Msk                                  (0xffU << TSI_CCR_SCAN_IDLE_Pos)
#define    TSI_CCR_SCAN_IDLE                                      TSI_CCR_SCAN_IDLE_Msk

#define    TSI_CCR_SCAN_INTV_Pos                                  (8U)
#define    TSI_CCR_SCAN_INTV_Msk                                  (0xffU << TSI_CCR_SCAN_INTV_Pos)
#define    TSI_CCR_SCAN_INTV                                      TSI_CCR_SCAN_INTV_Msk

#define    TSI_CCR_SMPL_WAIT_Pos                                  (1U)
#define    TSI_CCR_SMPL_WAIT_Msk                                  (0x7U << TSI_CCR_SMPL_WAIT_Pos)
#define    TSI_CCR_SMPL_WAIT                                      TSI_CCR_SMPL_WAIT_Msk

#define    TSI_CCR_PRSCLK_EN_Pos                                  (0U)
#define    TSI_CCR_PRSCLK_EN_Msk                                  (0x1U << TSI_CCR_PRSCLK_EN_Pos)
#define    TSI_CCR_PRSCLK_EN                                      TSI_CCR_PRSCLK_EN_Msk

#define    TSI_DMACR_DMA_WREN_Pos                                 (1U)
#define    TSI_DMACR_DMA_WREN_Msk                                 (0x1U << TSI_DMACR_DMA_WREN_Pos)
#define    TSI_DMACR_DMA_WREN                                     TSI_DMACR_DMA_WREN_Msk

#define    TSI_DMACR_DMA_RDEN_Pos                                 (0U)
#define    TSI_DMACR_DMA_RDEN_Msk                                 (0x1U << TSI_DMACR_DMA_RDEN_Pos)
#define    TSI_DMACR_DMA_RDEN                                     TSI_DMACR_DMA_RDEN_Msk

#define    TSI_CHCFGR_SNS_DIV_Pos                                 (20U)
#define    TSI_CHCFGR_SNS_DIV_Msk                                 (0xfffU << TSI_CHCFGR_SNS_DIV_Pos)
#define    TSI_CHCFGR_SNS_DIV                                     TSI_CHCFGR_SNS_DIV_Msk

#define    TSI_CHCFGR_RES_Pos                                     (16U)
#define    TSI_CHCFGR_RES_Msk                                     (0xfU << TSI_CHCFGR_RES_Pos)
#define    TSI_CHCFGR_RES                                         TSI_CHCFGR_RES_Msk

#define    TSI_CHCFGR_IDAC_MODE_Pos                               (15U)
#define    TSI_CHCFGR_IDAC_MODE_Msk                               (0x1U << TSI_CHCFGR_IDAC_MODE_Pos)
#define    TSI_CHCFGR_IDAC_MODE                                   TSI_CHCFGR_IDAC_MODE_Msk

#define    TSI_CHCFGR_IDAC2_CFG_Pos                               (8U)
#define    TSI_CHCFGR_IDAC2_CFG_Msk                               (0x7fU << TSI_CHCFGR_IDAC2_CFG_Pos)
#define    TSI_CHCFGR_IDAC2_CFG                                   TSI_CHCFGR_IDAC2_CFG_Msk

#define    TSI_CHCFGR_IDAC1_CFG_Pos                               (0U)
#define    TSI_CHCFGR_IDAC1_CFG_Msk                               (0x7fU << TSI_CHCFGR_IDAC1_CFG_Pos)
#define    TSI_CHCFGR_IDAC1_CFG                                   TSI_CHCFGR_IDAC1_CFG_Msk

#define    TSI_IDACTR_IDAC2_TRIM_Pos                              (8U)
#define    TSI_IDACTR_IDAC2_TRIM_Msk                              (0x1fU << TSI_IDACTR_IDAC2_TRIM_Pos)
#define    TSI_IDACTR_IDAC2_TRIM                                  TSI_IDACTR_IDAC2_TRIM_Msk

#define    TSI_IDACTR_IDAC1_TRIM_Pos                              (0U)
#define    TSI_IDACTR_IDAC1_TRIM_Msk                              (0x1fU << TSI_IDACTR_IDAC1_TRIM_Pos)
#define    TSI_IDACTR_IDAC1_TRIM                                  TSI_IDACTR_IDAC1_TRIM_Msk

#define    TSI_ANACR_LOWREF_SEL_Pos                               (24U)
#define    TSI_ANACR_LOWREF_SEL_Msk                               (0x3U << TSI_ANACR_LOWREF_SEL_Pos)
#define    TSI_ANACR_LOWREF_SEL                                   TSI_ANACR_LOWREF_SEL_Msk

#define    TSI_ANACR_CMP_AZ_BYP_Pos                               (23U)
#define    TSI_ANACR_CMP_AZ_BYP_Msk                               (0x1U << TSI_ANACR_CMP_AZ_BYP_Pos)
#define    TSI_ANACR_CMP_AZ_BYP                                   TSI_ANACR_CMP_AZ_BYP_Msk

#define    TSI_ANACR_HSCMP_AZ_BYP_Pos                             (22U)
#define    TSI_ANACR_HSCMP_AZ_BYP_Msk                             (0x1U << TSI_ANACR_HSCMP_AZ_BYP_Pos)
#define    TSI_ANACR_HSCMP_AZ_BYP                                 TSI_ANACR_HSCMP_AZ_BYP_Msk

#define    TSI_ANACR_LES_PCFG_Pos                                 (20U)
#define    TSI_ANACR_LES_PCFG_Msk                                 (0x3U << TSI_ANACR_LES_PCFG_Pos)
#define    TSI_ANACR_LES_PCFG                                     TSI_ANACR_LES_PCFG_Msk

#define    TSI_ANACR_LES_NCFG_Pos                                 (18U)
#define    TSI_ANACR_LES_NCFG_Msk                                 (0x3U << TSI_ANACR_LES_NCFG_Pos)
#define    TSI_ANACR_LES_NCFG                                     TSI_ANACR_LES_NCFG_Msk

#define    TSI_ANACR_IDAC2_MODE_CTRL_Pos                          (17U)
#define    TSI_ANACR_IDAC2_MODE_CTRL_Msk                          (0x1U << TSI_ANACR_IDAC2_MODE_CTRL_Pos)
#define    TSI_ANACR_IDAC2_MODE_CTRL                              TSI_ANACR_IDAC2_MODE_CTRL_Msk

#define    TSI_ANACR_IDAC1_MODE_CTRL_Pos                          (16U)
#define    TSI_ANACR_IDAC1_MODE_CTRL_Msk                          (0x1U << TSI_ANACR_IDAC1_MODE_CTRL_Pos)
#define    TSI_ANACR_IDAC1_MODE_CTRL                              TSI_ANACR_IDAC1_MODE_CTRL_Msk

#define    TSI_ANACR_IDAC2_DOUBLE_Pos                             (15U)
#define    TSI_ANACR_IDAC2_DOUBLE_Msk                             (0x1U << TSI_ANACR_IDAC2_DOUBLE_Pos)
#define    TSI_ANACR_IDAC2_DOUBLE                                 TSI_ANACR_IDAC2_DOUBLE_Msk

