GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_tsi.h
#define    TSI_PRSSSC_PRS_SSC_Pos                                 (0U)
#define    TSI_PRSSSC_PRS_SSC_Msk                                 (0x1fffU << TSI_PRSSSC_PRS_SSC_Pos)
#define    TSI_PRSSSC_PRS_SSC                                     TSI_PRSSSC_PRS_SSC_Msk



#define    FL_TSI_CHANNEL_0                                        0U
#define    FL_TSI_CHANNEL_1                                        1U
#define    FL_TSI_CHANNEL_2                                        2U
#define    FL_TSI_CHANNEL_3                                        3U
#define    FL_TSI_CHANNEL_4                                        4U
#define    FL_TSI_CHANNEL_5                                        5U
#define    FL_TSI_CHANNEL_6                                        6U
#define    FL_TSI_CHANNEL_7                                        7U
#define    FL_TSI_CHANNEL_8                                        8U
#define    FL_TSI_CHANNEL_9                                        9U
#define    FL_TSI_CHANNEL_10                                       10U
#define    FL_TSI_CHANNEL_11                                       11U
#define    FL_TSI_CHANNEL_12                                       12U
#define    FL_TSI_CHANNEL_13                                       13U
#define    FL_TSI_CHANNEL_14                                       14U
#define    FL_TSI_CHANNEL_15                                       15U
#define    FL_TSI_CHANNEL_16                                       16U
#define    FL_TSI_CHANNEL_17                                       17U
#define    FL_TSI_CHANNEL_18                                       18U
#define    FL_TSI_CHANNEL_19                                       19U
#define    FL_TSI_CHANNEL_20                                       20U
#define    FL_TSI_CHANNEL_21                                       21U
#define    FL_TSI_CHANNEL_22                                       22U
#define    FL_TSI_CHANNEL_23                                       23U
#define    FL_TSI_CHANNEL_24                                       24U
#define    FL_TSI_CHANNEL_25                                       25U
#define    FL_TSI_CHANNEL_26                                       26U
#define    FL_TSI_CHANNEL_27                                       27U
#define    FL_TSI_CHANNEL_28                                       28U
#define    FL_TSI_CHANNEL_29                                       29U
#define    FL_TSI_CHANNEL_30                                       30U
#define    FL_TSI_CHANNEL_31                                       31U
#define    FL_TSI_CHANNEL_32                                       32U
#define    FL_TSI_CHANNEL_33                                       33U
#define    FL_TSI_CHANNEL_34                                       34U
#define    FL_TSI_CHANNEL_35                                       35U


#define    FL_TSI_PAD_PE6                                         (0x1U << 0U)
#define    FL_TSI_PAD_PE7                                         (0x1U << 1U)
#define    FL_TSI_PAD_PE8                                         (0x1U << 2U)
#define    FL_TSI_PAD_PE9                                         (0x1U << 3U)
#define    FL_TSI_PAD_PF12                                        (0x1U << 4U)
#define    FL_TSI_PAD_PF13                                        (0x1U << 5U)
#define    FL_TSI_PAD_PF14                                        (0x1U << 6U)
#define    FL_TSI_PAD_PF15                                        (0x1U << 7U)
#define    FL_TSI_PAD_PC0                                         (0x1U << 8U)
#define    FL_TSI_PAD_PC1                                         (0x1U << 9U)
#define    FL_TSI_PAD_PC2                                         (0x1U << 10U)
#define    FL_TSI_PAD_PC3                                         (0x1U << 11U)
#define    FL_TSI_PAD_PC4                                         (0x1U << 12U)
#define    FL_TSI_PAD_PC5                                         (0x1U << 13U)
#define    FL_TSI_PAD_PC6                                         (0x1U << 14U)
#define    FL_TSI_PAD_PC7                                         (0x1U << 15U)
#define    FL_TSI_PAD_PC8                                         (0x1U << 16U)
#define    FL_TSI_PAD_PC9                                         (0x1U << 17U)
#define    FL_TSI_PAD_PC10                                        (0x1U << 18U)
#define    FL_TSI_PAD_PC11                                        (0x1U << 19U)
#define    FL_TSI_PAD_PC12                                        (0x1U << 20U)
#define    FL_TSI_PAD_PC13                                        (0x1U << 21U)
#define    FL_TSI_PAD_PC14                                        (0x1U << 22U)



#define    FL_TSI_SCAN_MODE_SELF_SINGLE                           (0x0U << TSI_CFGR_TSI_MOD_Pos)
#define    FL_TSI_SCAN_MODE_SELF_MULTI                            (0x1U << TSI_CFGR_TSI_MOD_Pos)
#define    FL_TSI_SCAN_MODE_MUTUAL                                (0x2U << TSI_CFGR_TSI_MOD_Pos)


#define    FL_TSI_TRGI_RTC                                        (0x0U << TSI_CFGR_TRIG_SEL_Pos)
#define    FL_TSI_TRGI_ATIM                                       (0x1U << TSI_CFGR_TRIG_SEL_Pos)
#define    FL_TSI_TRGI_LPTIM16                                    (0x2U << TSI_CFGR_TRIG_SEL_Pos)
#define    FL_TSI_TRGI_BSTIM16                                    (0x3U << TSI_CFGR_TRIG_SEL_Pos)
#define    FL_TSI_TRGI_TAU00                                      (0x4U << TSI_CFGR_TRIG_SEL_Pos)
#define    FL_TSI_TRGI_TAU01                                      (0x5U << TSI_CFGR_TRIG_SEL_Pos)
#define    FL_TSI_TRGI_TAU02                                      (0x6U << TSI_CFGR_TRIG_SEL_Pos)
#define    FL_TSI_TRGI_TAU03                                      (0x7U << TSI_CFGR_TRIG_SEL_Pos)
#define    FL_TSI_TRGI_TAU04                                      (0x8U << TSI_CFGR_TRIG_SEL_Pos)
#define    FL_TSI_TRGI_TAU05                                      (0x9U << TSI_CFGR_TRIG_SEL_Pos)
#define    FL_TSI_TRGI_TAU06                                      (0xaU << TSI_CFGR_TRIG_SEL_Pos)
#define    FL_TSI_TRGI_TAU07                                      (0xbU << TSI_CFGR_TRIG_SEL_Pos)
#define    FL_TSI_TRGI_TAU10                                      (0xcU << TSI_CFGR_TRIG_SEL_Pos)
#define    FL_TSI_TRGI_TAU11                                      (0xdU << TSI_CFGR_TRIG_SEL_Pos)
#define    FL_TSI_TRGI_TAU12                                      (0xeU << TSI_CFGR_TRIG_SEL_Pos)

