GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_tsi.h
#define    FL_TSI_PROX_AVGFILTER_ORDER_2X                         (0x0U << TSI_CFGR_AVG_ORDER_Pos)
#define    FL_TSI_PROX_AVGFILTER_ORDER_4X                         (0x1U << TSI_CFGR_AVG_ORDER_Pos)
#define    FL_TSI_PROX_AVGFILTER_ORDER_8X                         (0x2U << TSI_CFGR_AVG_ORDER_Pos)
#define    FL_TSI_PROX_AVGFILTER_ORDER_16X                        (0x3U << TSI_CFGR_AVG_ORDER_Pos)


#define    FL_TSI_TRIG_MODE_SOFTWARE                              (0x0U << TSI_CFGR_TMOD_Pos)
#define    FL_TSI_TRIG_MODE_HARDWARE                              (0x1U << TSI_CFGR_TMOD_Pos)


#define    FL_TSI_SAMPLE_CLK_SOURCE_FIXED_CLK                     (0x0U << TSI_CCR_PRSCLK_EN_Pos)
#define    FL_TSI_SAMPLE_CLK_SOURCE_PRS_CLK                       (0x1U << TSI_CCR_PRSCLK_EN_Pos)


#define    FL_TSI_SAMPLE_RESOLUTION_8B                            (0x0U << TSI_CHCFGR_RES_Pos)
#define    FL_TSI_SAMPLE_RESOLUTION_9B                            (0x1U << TSI_CHCFGR_RES_Pos)
#define    FL_TSI_SAMPLE_RESOLUTION_10B                           (0x2U << TSI_CHCFGR_RES_Pos)
#define    FL_TSI_SAMPLE_RESOLUTION_11B                           (0x3U << TSI_CHCFGR_RES_Pos)
#define    FL_TSI_SAMPLE_RESOLUTION_12B                           (0x4U << TSI_CHCFGR_RES_Pos)
#define    FL_TSI_SAMPLE_RESOLUTION_13B                           (0x5U << TSI_CHCFGR_RES_Pos)
#define    FL_TSI_SAMPLE_RESOLUTION_14B                           (0x6U << TSI_CHCFGR_RES_Pos)
#define    FL_TSI_SAMPLE_RESOLUTION_15B                           (0x7U << TSI_CHCFGR_RES_Pos)
#define    FL_TSI_SAMPLE_RESOLUTION_16B                           (0x8U << TSI_CHCFGR_RES_Pos)


#define    FL_TSI_IDAC_MODE_SINGLE                                (0x0U << TSI_CHCFGR_IDAC_MODE_Pos)
#define    FL_TSI_IDAC_MODE_DUAL                                  (0x1U << TSI_CHCFGR_IDAC_MODE_Pos)


#define    FL_TSI_IDAC2_MODE_SELF_CAPACITANCE                     (0x1U << TSI_ANACR_IDAC2_MODE_CTRL_Pos)
#define    FL_TSI_IDAC2_MODE_MUTUAL_CAPACITANCE                   (0x0U << TSI_ANACR_IDAC2_MODE_CTRL_Pos)


#define    FL_TSI_IDAC1_MODE_SELF_CAPACITANCE                     (0x1U << TSI_ANACR_IDAC1_MODE_CTRL_Pos)
#define    FL_TSI_IDAC1_MODE_MUTUAL_CAPACITANCE                   (0x1U << TSI_ANACR_IDAC1_MODE_CTRL_Pos)


#define    FL_TSI_IDAC2_STEP_2P4uA                                (0x3U << TSI_ANACR_IDAC2_RANGET_Pos)
#define    FL_TSI_IDAC2_STEP_1P2uA                                (0x2U << TSI_ANACR_IDAC2_RANGET_Pos)
#define    FL_TSI_IDAC2_STEP_300nA                                (0x1U << TSI_ANACR_IDAC2_RANGET_Pos)
#define    FL_TSI_IDAC2_STEP_37P5nA                               (0x0U << TSI_ANACR_IDAC2_RANGET_Pos)


#define    FL_TSI_IDAC1_STEP_2P4uA                                (0x3U << TSI_ANACR_IDAC1_RANGET_Pos)
#define    FL_TSI_IDAC1_STEP_1P2uA                                (0x2U << TSI_ANACR_IDAC1_RANGET_Pos)
#define    FL_TSI_IDAC1_STEP_300nA                                (0x1U << TSI_ANACR_IDAC1_RANGET_Pos)
#define    FL_TSI_IDAC1_STEP_37P5nA                               (0x0U << TSI_ANACR_IDAC1_RANGET_Pos)


#define    FL_TSI_SHIELD_MOD_DIRECT                               (0x0U << TSI_ANACR_SHIELD_MOD_Pos)
#define    FL_TSI_SHIELD_MOD_INTERBUFFER                          (0x1U << TSI_ANACR_SHIELD_MOD_Pos)
#define    FL_TSI_SHIELD_MOD_EXTERCAPACITORS                      (0x2U << TSI_ANACR_SHIELD_MOD_Pos)


#define    FL_TSI_CMP_RC_1P48MHZ                                  (0x0U << TSI_ANACR_CMP_RC_Pos)
#define    FL_TSI_CMP_RC_0P529MHZ                                 (0x1U << TSI_ANACR_CMP_RC_Pos)
#define    FL_TSI_CMP_RC_0P4MHZ                                   (0x2U << TSI_ANACR_CMP_RC_Pos)
#define    FL_TSI_CMP_RC_0P293MHZ                                 (0x3U << TSI_ANACR_CMP_RC_Pos)


#define    FL_TSI_VREFBUF_CFG_DISABLE                             (0x0U << TSI_ANACR_VREFBUF_CFG_Pos)
#define    FL_TSI_VREFBUF_CFG_LOW                                 (0x1U << TSI_ANACR_VREFBUF_CFG_Pos)
#define    FL_TSI_VREFBUF_CFG_MEDIUM                              (0x2U << TSI_ANACR_VREFBUF_CFG_Pos)
#define    FL_TSI_VREFBUF_CFG_HIGH                                (0x3U << TSI_ANACR_VREFBUF_CFG_Pos)


#define    FL_TSI_SENSE_CFG_INVALID                               (0x0U << TSI_TEST_SENSE_CFG_Pos)
#define    FL_TSI_SENSE_CFG_0P1pF                                 (0x1U << TSI_TEST_SENSE_CFG_Pos)
#define    FL_TSI_SENSE_CFG_0P2pF                                 (0x2U << TSI_TEST_SENSE_CFG_Pos)
#define    FL_TSI_SENSE_CFG_0P3pF                                 (0x3U << TSI_TEST_SENSE_CFG_Pos)
#define    FL_TSI_SENSE_CFG_0P4pF                                 (0x4U << TSI_TEST_SENSE_CFG_Pos)
#define    FL_TSI_SENSE_CFG_0P5pF                                 (0x5U << TSI_TEST_SENSE_CFG_Pos)
#define    FL_TSI_SENSE_CFG_0P6pF                                 (0x6U << TSI_TEST_SENSE_CFG_Pos)
#define    FL_TSI_SENSE_CFG_0P7pF                                 (0x7U << TSI_TEST_SENSE_CFG_Pos)
#define    FL_TSI_SENSE_CFG_0P8pF                                 (0x8U << TSI_TEST_SENSE_CFG_Pos)
#define    FL_TSI_SENSE_CFG_0P9pF                                 (0x9U << TSI_TEST_SENSE_CFG_Pos)
#define    FL_TSI_SENSE_CFG_1P0pF                                 (0xaU << TSI_TEST_SENSE_CFG_Pos)
#define    FL_TSI_SENSE_CFG_1P1pF                                 (0xbU << TSI_TEST_SENSE_CFG_Pos)
#define    FL_TSI_SENSE_CFG_1P2pF                                 (0xcU << TSI_TEST_SENSE_CFG_Pos)
#define    FL_TSI_SENSE_CFG_1P3pF                                 (0xdU << TSI_TEST_SENSE_CFG_Pos)
#define    FL_TSI_SENSE_CFG_1P4pF                                 (0xeU << TSI_TEST_SENSE_CFG_Pos)
#define    FL_TSI_SENSE_CFG_1P5pF                                 (0xfU << TSI_TEST_SENSE_CFG_Pos)


#define    FL_TSI_CH_IDLE_CFG_FLOAT                               (0x0U << TSI_TEST_CH_IDLE_CFG_Pos)
#define    FL_TSI_CH_IDLE_CFG_GROUND                              (0x1U << TSI_TEST_CH_IDLE_CFG_Pos)


#define    FL_TSI_R2D_CFG_100K                                    (0x0U << TSI_TEST_R2D_CFG_Pos)
#define    FL_TSI_R2D_CFG_150K                                    (0x1U << TSI_TEST_R2D_CFG_Pos)
#define    FL_TSI_R2D_CFG_200K                                    (0x2U << TSI_TEST_R2D_CFG_Pos)
#define    FL_TSI_R2D_CFG_250K                                    (0x3U << TSI_TEST_R2D_CFG_Pos)


#define    FL_TSI_TST_CONN_RESISTANCE                             (0x0U << TSI_TEST_SENSI_VALID_Pos)
#define    FL_TSI_TST_CONN_CAPARRAY                               (0x1U << TSI_TEST_SENSI_VALID_Pos)


#define    FL_TSI_EXCAP_SEL_CINTA                                 (0x0U << TSI_ANATEST_EXCAP_SEL_Pos)
#define    FL_TSI_EXCAP_SEL_CINTB                                 (0x1U << TSI_ANATEST_EXCAP_SEL_Pos)
#define    FL_TSI_EXCAP_SEL_CTANK                                 (0x2U << TSI_ANATEST_EXCAP_SEL_Pos)
#define    FL_TSI_EXCAP_SEL_CMOD                                  (0x3U << TSI_ANATEST_EXCAP_SEL_Pos)


#define    FL_TSI_VCOMP_FB_RISINGEDGE                             (0x0U << TSI_ANATEST_VCOMP_FB_Pos)
#define    FL_TSI_VCOMP_FB_FALLINGEDGE                            (0x1U << TSI_ANATEST_VCOMP_FB_Pos)


#define    FL_TSI_IDAC_COMP_MODE_NORMALLYOPEN                     (0x0U << TSI_ANATEST_IDAC_COMP_MODE_Pos)
#define    FL_TSI_IDAC_COMP_MODE_COMPLEMENTATION                  (0x1U << TSI_ANATEST_IDAC_COMP_MODE_Pos)


