GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_tsi.h
#define    FL_TSI_DEFAULT                                         (0x0U << TSI_EMICR0_SR_CFG0_Pos)
#define    FL_TSI_SLOW                                            (0x1U << TSI_EMICR0_SR_CFG0_Pos)


#define    FL_TSI_SSC_FPT_32                                      (0x0U << TSI_CKCR_SSC_FPT_Pos)
#define    FL_TSI_SSC_FPT_64                                      (0x1U << TSI_CKCR_SSC_FPT_Pos)
#define    FL_TSI_SSC_FPT_128                                     (0x2U << TSI_CKCR_SSC_FPT_Pos)
#define    FL_TSI_SSC_FPT_256                                     (0x3U << TSI_CKCR_SSC_FPT_Pos)


#define    FL_TSI_SNSSEL_FMOD                                     (0x0U << TSI_CKCR_SNSSEL_Pos)
#define    FL_TSI_SNSSEL_PLL_TSI                                  (0x1U << TSI_CKCR_SNSSEL_Pos)


#define    FL_TSI_PLLDB_DB_32                                     (0x1fU << TSI_PLLCR_PLLDB_Pos)
#define    FL_TSI_PLLDB_DB_48                                     (0x2fU << TSI_PLLCR_PLLDB_Pos)
#define    FL_TSI_PLLDB_DB_64                                     (0x3fU << TSI_PLLCR_PLLDB_Pos)
#define    FL_TSI_PLLDB_DB_72                                     (0x47U << TSI_PLLCR_PLLDB_Pos)

/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup TSI_FL_Exported_Functions TSI Exported Functions
  * @{
  */

/**
  * @brief    
  * @rmtoll   ISR    SEQF    FL_TSI_IsActiveFlag_EndOfSequence
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsActiveFlag_EndOfSequence(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ISR, TSI_ISR_SEQF_Msk) == (TSI_ISR_SEQF_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    SEQF    FL_TSI_ClearFlag_EndOfSequence
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_ClearFlag_EndOfSequence(TSI_Type *TSIx)
{
    WRITE_REG(TSIx->ISR, TSI_ISR_SEQF_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    CHF    FL_TSI_IsActiveFlag_EndOfChannel
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsActiveFlag_EndOfChannel(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ISR, TSI_ISR_CHF_Msk) == (TSI_ISR_CHF_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    CHF    FL_TSI_ClearFlag_EndOfChannel
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_ClearFlag_EndOfChannel(TSI_Type *TSIx)
{
    WRITE_REG(TSIx->ISR, TSI_ISR_CHF_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    RCUF    FL_TSI_IsActiveFlag_RawCountUpdate
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsActiveFlag_RawCountUpdate(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ISR, TSI_ISR_RCUF_Msk) == (TSI_ISR_RCUF_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    RCUF    FL_TSI_ClearFlag_RawCountUpdate
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_ClearFlag_RawCountUpdate(TSI_Type *TSIx)
{
    WRITE_REG(TSIx->ISR, TSI_ISR_RCUF_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    SEQ_IE    FL_TSI_EnableIT_EndOfSequence
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableIT_EndOfSequence(TSI_Type *TSIx)
{
    SET_BIT(TSIx->IER, TSI_IER_SEQ_IE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    SEQ_IE    FL_TSI_DisableIT_EndOfSequence
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableIT_EndOfSequence(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->IER, TSI_IER_SEQ_IE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    SEQ_IE    FL_TSI_IsEnabledIT_EndOfSequence
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledIT_EndOfSequence(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->IER, TSI_IER_SEQ_IE_Msk) == TSI_IER_SEQ_IE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    CH_IE    FL_TSI_EnableIT_EndOfChannel
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableIT_EndOfChannel(TSI_Type *TSIx)
{
    SET_BIT(TSIx->IER, TSI_IER_CH_IE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    CH_IE    FL_TSI_DisableIT_EndOfChannel
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableIT_EndOfChannel(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->IER, TSI_IER_CH_IE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    CH_IE    FL_TSI_IsEnabledIT_EndOfChannel
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledIT_EndOfChannel(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->IER, TSI_IER_CH_IE_Msk) == TSI_IER_CH_IE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    RCU_IE    FL_TSI_EnableIT_RawCountUpdate
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableIT_RawCountUpdate(TSI_Type *TSIx)
{
    SET_BIT(TSIx->IER, TSI_IER_RCU_IE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    RCU_IE    FL_TSI_DisableIT_RawCountUpdate
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableIT_RawCountUpdate(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->IER, TSI_IER_RCU_IE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    RCU_IE    FL_TSI_IsEnabledIT_RawCountUpdate
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledIT_RawCountUpdate(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->IER, TSI_IER_RCU_IE_Msk) == TSI_IER_RCU_IE_Msk);
}

/**
  * @brief    
  * @rmtoll   RXSSR    RXSSR    FL_TSI_ReadScanRxChannel
  * @param    TSIx TSI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_TSI_ReadScanRxChannel(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->RXSR, (0x3fU << 0U)) >> 0U);
}

/**
  * @brief    
  * @rmtoll   TXSSR    TXSSR    FL_TSI_ReadScanTxChannel
  * @param    TSIx TSI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_TSI_ReadScanTxChannel(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->TXSR, (0x3fU << 0U)) >> 0U);
}

/**
  * @brief    
  * @rmtoll   CFGR    SMPL_SIZE    FL_TSI_WriteSampleSize
  * @param    TSIx TSI instance
  * @param    size 
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_WriteSampleSize(TSI_Type *TSIx, uint32_t size)
{
    MODIFY_REG(TSIx->CFGR, (0xfU << 28U), (size << 28U));
}

/**
  * @brief    
  * @rmtoll   CFGR    SMPL_SIZE    FL_TSI_ReadSampleSize
  * @param    TSIx TSI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_TSI_ReadSampleSize(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->CFGR, (0xfU << 28U)) >> 28U);
}

/**
  * @brief    
  * @rmtoll   CFGR    TSI_MOD    FL_TSI_SetScanMode
  * @param    TSIx TSI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_TSI_SCAN_MODE_SELF_SINGLE
  *           @arg @ref FL_TSI_SCAN_MODE_SELF_MULTI
  *           @arg @ref FL_TSI_SCAN_MODE_MUTUAL
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetScanMode(TSI_Type *TSIx, uint32_t mode)
{
    MODIFY_REG(TSIx->CFGR, TSI_CFGR_TSI_MOD_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   CFGR    TSI_MOD    FL_TSI_GetScanMode
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_TSI_SCAN_MODE_SELF_SINGLE
  *           @arg @ref FL_TSI_SCAN_MODE_SELF_MULTI
  *           @arg @ref FL_TSI_SCAN_MODE_MUTUAL
  */
__STATIC_INLINE uint32_t FL_TSI_GetScanMode(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->CFGR, TSI_CFGR_TSI_MOD_Msk));
}

/**
  * @brief    
  * @rmtoll   CFGR    CHCFG_WAIT    FL_TSI_EnableWait
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableWait(TSI_Type *TSIx)
{
    SET_BIT(TSIx->CFGR, TSI_CFGR_CHCFG_WAIT_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    CHCFG_WAIT    FL_TSI_DisableWait
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableWait(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->CFGR, TSI_CFGR_CHCFG_WAIT_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    CHCFG_WAIT    FL_TSI_IsEnabledWait
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledWait(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->CFGR, TSI_CFGR_CHCFG_WAIT_Msk) == TSI_CFGR_CHCFG_WAIT_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    TRIG_SEL    FL_TSI_SetTriggerInput
  * @param    TSIx TSI instance
  * @param    trigger This parameter can be one of the following values:
  *           @arg @ref FL_TSI_TRGI_RTC
  *           @arg @ref FL_TSI_TRGI_ATIM
  *           @arg @ref FL_TSI_TRGI_LPTIM16
  *           @arg @ref FL_TSI_TRGI_BSTIM16
  *           @arg @ref FL_TSI_TRGI_TAU00
  *           @arg @ref FL_TSI_TRGI_TAU01
  *           @arg @ref FL_TSI_TRGI_TAU02
  *           @arg @ref FL_TSI_TRGI_TAU03
  *           @arg @ref FL_TSI_TRGI_TAU04
  *           @arg @ref FL_TSI_TRGI_TAU05
  *           @arg @ref FL_TSI_TRGI_TAU06
  *           @arg @ref FL_TSI_TRGI_TAU07
  *           @arg @ref FL_TSI_TRGI_TAU10
  *           @arg @ref FL_TSI_TRGI_TAU11
  *           @arg @ref FL_TSI_TRGI_TAU12
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetTriggerInput(TSI_Type *TSIx, uint32_t trigger)
{
    MODIFY_REG(TSIx->CFGR, TSI_CFGR_TRIG_SEL_Msk, trigger);
}

/**
  * @brief    
  * @rmtoll   CFGR    TRIG_SEL    FL_TSI_GetTriggerInput
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_TSI_GetTriggerInput(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->CFGR, TSI_CFGR_TRIG_SEL_Msk));
}

/**
  * @brief    
  * @rmtoll   CFGR    AVG_ORDER    FL_TSI_SetSensorAverageFilterOrder
  * @param    TSIx TSI instance
  * @param    order This parameter can be one of the following values:
  *           @arg @ref FL_TSI_PROX_AVGFILTER_ORDER_2X
  *           @arg @ref FL_TSI_PROX_AVGFILTER_ORDER_4X
  *           @arg @ref FL_TSI_PROX_AVGFILTER_ORDER_8X
  *           @arg @ref FL_TSI_PROX_AVGFILTER_ORDER_16X
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetSensorAverageFilterOrder(TSI_Type *TSIx, uint32_t order)
{
    MODIFY_REG(TSIx->CFGR, TSI_CFGR_AVG_ORDER_Msk, order);
}

/**
  * @brief    
  * @rmtoll   CFGR    AVG_ORDER    FL_TSI_GetSensorAverageFilterOrder
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_TSI_PROX_AVGFILTER_ORDER_2X
  *           @arg @ref FL_TSI_PROX_AVGFILTER_ORDER_4X
  *           @arg @ref FL_TSI_PROX_AVGFILTER_ORDER_8X
  *           @arg @ref FL_TSI_PROX_AVGFILTER_ORDER_16X
  */
__STATIC_INLINE uint32_t FL_TSI_GetSensorAverageFilterOrder(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->CFGR, TSI_CFGR_AVG_ORDER_Msk));
}

/**
  * @brief    
  * @rmtoll   CFGR    AVG_EN    FL_TSI_EnableSensorAverageFilter
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableSensorAverageFilter(TSI_Type *TSIx)
{
    SET_BIT(TSIx->CFGR, TSI_CFGR_AVG_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    AVG_EN    FL_TSI_DisableSensorAverageFilter
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableSensorAverageFilter(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->CFGR, TSI_CFGR_AVG_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    AVG_EN    FL_TSI_IsEnabledSensorAverageFilter
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledSensorAverageFilter(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->CFGR, TSI_CFGR_AVG_EN_Msk) == TSI_CFGR_AVG_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    TMOD    FL_TSI_SetTriggerMode
  * @param    TSIx TSI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_TSI_TRIG_MODE_SOFTWARE
  *           @arg @ref FL_TSI_TRIG_MODE_HARDWARE
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetTriggerMode(TSI_Type *TSIx, uint32_t mode)
{
    MODIFY_REG(TSIx->CFGR, TSI_CFGR_TMOD_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   CFGR    TMOD    FL_TSI_GetTriggerMode
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_TSI_TRIG_MODE_SOFTWARE
  *           @arg @ref FL_TSI_TRIG_MODE_HARDWARE
  */
__STATIC_INLINE uint32_t FL_TSI_GetTriggerMode(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->CFGR, TSI_CFGR_TMOD_Msk));
}

/**
  * @brief    
  * @rmtoll   CFGR    SHIELD_EN    FL_TSI_EnableShield
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableShield(TSI_Type *TSIx)
{
    SET_BIT(TSIx->CFGR, TSI_CFGR_SHIELD_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    SHIELD_EN    FL_TSI_DisableShield
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableShield(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->CFGR, TSI_CFGR_SHIELD_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    SHIELD_EN    FL_TSI_IsEnabledShield
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledShield(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->CFGR, TSI_CFGR_SHIELD_EN_Msk) == TSI_CFGR_SHIELD_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    SEN    FL_TSI_Enable
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_Enable(TSI_Type *TSIx)
{
    SET_BIT(TSIx->CFGR, TSI_CFGR_SEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    SEN    FL_TSI_Disable
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_Disable(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->CFGR, TSI_CFGR_SEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    SEN    FL_TSI_IsEnabled
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabled(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->CFGR, TSI_CFGR_SEN_Msk) == TSI_CFGR_SEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    STOP    FL_TSI_EnableScanStop
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableScanStop(TSI_Type *TSIx)
{
    SET_BIT(TSIx->CR, TSI_CR_STOP_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    SCAN_CON    FL_TSI_EnableScanNext
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableScanNext(TSI_Type *TSIx)
{
    SET_BIT(TSIx->CR, TSI_CR_SCAN_CON_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    START    FL_TSI_EnableScanStart
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableScanStart(TSI_Type *TSIx)
{
    SET_BIT(TSIx->CR, TSI_CR_START_Msk);
}

/**
  * @brief
  * @rmtoll   FL_TSI_EnableChannel
  * @param    TSIx TSI instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_TSI_CHANNEL_0
              @arg @ref FL_TSI_CHANNEL_1
              @arg @ref FL_TSI_CHANNEL_2
              @arg @ref FL_TSI_CHANNEL_3
              @arg @ref FL_TSI_CHANNEL_4                        
              @arg @ref FL_TSI_CHANNEL_5                        
              @arg @ref FL_TSI_CHANNEL_6                        
              @arg @ref FL_TSI_CHANNEL_7                        
              @arg @ref FL_TSI_CHANNEL_8                        
              @arg @ref FL_TSI_CHANNEL_9                        
              @arg @ref FL_TSI_CHANNEL_10                         
              @arg @ref FL_TSI_CHANNEL_11                        
              @arg @ref FL_TSI_CHANNEL_12                        
              @arg @ref FL_TSI_CHANNEL_13                        
              @arg @ref FL_TSI_CHANNEL_14                                     
              @arg @ref FL_TSI_CHANNEL_15                        
              @arg @ref FL_TSI_CHANNEL_16                        
              @arg @ref FL_TSI_CHANNEL_17                        
              @arg @ref FL_TSI_CHANNEL_18                        
              @arg @ref FL_TSI_CHANNEL_19                        
              @arg @ref FL_TSI_CHANNEL_20                        
              @arg @ref FL_TSI_CHANNEL_21                        
              @arg @ref FL_TSI_CHANNEL_22                        
              @arg @ref FL_TSI_CHANNEL_23                        
              @arg @ref FL_TSI_CHANNEL_24                        
              @arg @ref FL_TSI_CHANNEL_25                        
              @arg @ref FL_TSI_CHANNEL_26                        
              @arg @ref FL_TSI_CHANNEL_27                        
              @arg @ref FL_TSI_CHANNEL_28                        
              @arg @ref FL_TSI_CHANNEL_29                        
              @arg @ref FL_TSI_CHANNEL_30                        
              @arg @ref FL_TSI_CHANNEL_31                        
              @arg @ref FL_TSI_CHANNEL_32                        
              @arg @ref FL_TSI_CHANNEL_33                        
              @arg @ref FL_TSI_CHANNEL_34                        
              @arg @ref FL_TSI_CHANNEL_35                        

  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableChannel(TSI_Type *TSIx, uint32_t channel)
{
    if(channel < 32)
    {
        SET_BIT(TSIx->CHCR0, 1<<channel);
    }
    else if(channel > 31 & channel < 36)
    {
        SET_BIT(TSIx->CHCR1, 1<<(channel - 32));
    }
}

/**
  * @brief    
  * @rmtoll           FL_TSI_DisableChannel
  * @param    TSIx TSI instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_TSI_CHANNEL_0
              @arg @ref FL_TSI_CHANNEL_1
              @arg @ref FL_TSI_CHANNEL_2
              @arg @ref FL_TSI_CHANNEL_3
              @arg @ref FL_TSI_CHANNEL_4                        
              @arg @ref FL_TSI_CHANNEL_5                        
              @arg @ref FL_TSI_CHANNEL_6                        
              @arg @ref FL_TSI_CHANNEL_7                        
              @arg @ref FL_TSI_CHANNEL_8                        
              @arg @ref FL_TSI_CHANNEL_9                        
              @arg @ref FL_TSI_CHANNEL_10                         
              @arg @ref FL_TSI_CHANNEL_11                        
              @arg @ref FL_TSI_CHANNEL_12                        
              @arg @ref FL_TSI_CHANNEL_13                        
              @arg @ref FL_TSI_CHANNEL_14                                     
              @arg @ref FL_TSI_CHANNEL_15                        
              @arg @ref FL_TSI_CHANNEL_16                        
              @arg @ref FL_TSI_CHANNEL_17                        
              @arg @ref FL_TSI_CHANNEL_18                        
              @arg @ref FL_TSI_CHANNEL_19                        
              @arg @ref FL_TSI_CHANNEL_20                        
              @arg @ref FL_TSI_CHANNEL_21                        
              @arg @ref FL_TSI_CHANNEL_22                        
              @arg @ref FL_TSI_CHANNEL_23                        
              @arg @ref FL_TSI_CHANNEL_24                        
              @arg @ref FL_TSI_CHANNEL_25                        
              @arg @ref FL_TSI_CHANNEL_26                        
              @arg @ref FL_TSI_CHANNEL_27                        
              @arg @ref FL_TSI_CHANNEL_28                        
              @arg @ref FL_TSI_CHANNEL_29                        
              @arg @ref FL_TSI_CHANNEL_30                        
              @arg @ref FL_TSI_CHANNEL_31                        
              @arg @ref FL_TSI_CHANNEL_32                        
              @arg @ref FL_TSI_CHANNEL_33                        
              @arg @ref FL_TSI_CHANNEL_34                        
              @arg @ref FL_TSI_CHANNEL_35                        

  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableChannel(TSI_Type *TSIx, uint32_t channel)
{
    if(channel < 32)
    {
        CLEAR_BIT(TSIx->CHCR0, 1<<channel);
    }
    else if(channel > 31 & channel < 36)
    {
        CLEAR_BIT(TSIx->CHCR1, 1<<(channel - 32));
    }
}
/**
  * @brief    
  * @rmtoll           FL_TSI_IsEnabledChannel
  * @param    TSIx TSI instance 
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_TSI_CHANNEL_0
              @arg @ref FL_TSI_CHANNEL_1
              @arg @ref FL_TSI_CHANNEL_2
              @arg @ref FL_TSI_CHANNEL_3
              @arg @ref FL_TSI_CHANNEL_4                        
              @arg @ref FL_TSI_CHANNEL_5                        
              @arg @ref FL_TSI_CHANNEL_6                        
              @arg @ref FL_TSI_CHANNEL_7                        
              @arg @ref FL_TSI_CHANNEL_8                        
              @arg @ref FL_TSI_CHANNEL_9                        
              @arg @ref FL_TSI_CHANNEL_10                         
              @arg @ref FL_TSI_CHANNEL_11                        
              @arg @ref FL_TSI_CHANNEL_12                        
              @arg @ref FL_TSI_CHANNEL_13                        
              @arg @ref FL_TSI_CHANNEL_14                                     
              @arg @ref FL_TSI_CHANNEL_15                        
              @arg @ref FL_TSI_CHANNEL_16                        
              @arg @ref FL_TSI_CHANNEL_17                        
              @arg @ref FL_TSI_CHANNEL_18                        
              @arg @ref FL_TSI_CHANNEL_19                        
              @arg @ref FL_TSI_CHANNEL_20                        
              @arg @ref FL_TSI_CHANNEL_21                        
              @arg @ref FL_TSI_CHANNEL_22                        
              @arg @ref FL_TSI_CHANNEL_23                        
              @arg @ref FL_TSI_CHANNEL_24                        
              @arg @ref FL_TSI_CHANNEL_25                        
              @arg @ref FL_TSI_CHANNEL_26                        
              @arg @ref FL_TSI_CHANNEL_27                        
              @arg @ref FL_TSI_CHANNEL_28                        
              @arg @ref FL_TSI_CHANNEL_29                        
              @arg @ref FL_TSI_CHANNEL_30                        
              @arg @ref FL_TSI_CHANNEL_31                        
              @arg @ref FL_TSI_CHANNEL_32                        
              @arg @ref FL_TSI_CHANNEL_33                        
              @arg @ref FL_TSI_CHANNEL_34                        
              @arg @ref FL_TSI_CHANNEL_35                        

  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledChannel(TSI_Type *TSIx,uint32_t channel)
{
    if(channel < 32)
    {
        return (uint32_t)(READ_BIT(TSIx->CHCR0, 1 << channel) == (1 << channel));
    }
    else if(channel > 31 & channel < 36)
    {
        return (uint32_t)(READ_BIT(TSIx->CHCR1, 1 << (channel - 32)) == (1 << (channel - 32)));
    }
    else
    {
        return 0;
    }
}

