GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_tsi.h
/**
  * @brief    
  * @rmtoll   ANACR    LES_NCFG    FL_TSI_GetLowEMISwitchNMOS
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_TSI_GetLowEMISwitchNMOS(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ANACR, TSI_ANACR_LES_NCFG_Msk));
}


/**
  * @brief    
  * @rmtoll   ANACR    IDAC2_MODE_CTRL    FL_TSI_SetIDAC2Mode
  * @param    TSIx TSI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_TSI_IDAC2_MODE_SELF_CAPACITANCE
  *           @arg @ref FL_TSI_IDAC2_MODE_MUTUAL_CAPACITANCE
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetIDAC2Mode(TSI_Type *TSIx, uint32_t mode)
{
    MODIFY_REG(TSIx->ANACR, TSI_ANACR_IDAC2_MODE_CTRL_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   ANACR    IDAC2_MODE_CTRL    FL_TSI_GetIDAC2Mode
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_TSI_IDAC2_MODE_SELF_CAPACITANCE
  *           @arg @ref FL_TSI_IDAC2_MODE_MUTUAL_CAPACITANCE
  */
__STATIC_INLINE uint32_t FL_TSI_GetIDAC2Mode(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ANACR, TSI_ANACR_IDAC2_MODE_CTRL_Msk));
}

/**
  * @brief    
  * @rmtoll   ANACR    IDAC1_MODE_CTRL    FL_TSI_SetIDAC1Mode
  * @param    TSIx TSI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_TSI_IDAC1_MODE_SELF_CAPACITANCE
  *           @arg @ref FL_TSI_IDAC1_MODE_MUTUAL_CAPACITANCE
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetIDAC1Mode(TSI_Type *TSIx, uint32_t mode)
{
    MODIFY_REG(TSIx->ANACR, TSI_ANACR_IDAC1_MODE_CTRL_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   ANACR    IDAC1_MODE_CTRL    FL_TSI_GetIDAC1Mode
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_TSI_IDAC1_MODE_SELF_CAPACITANCE
  *           @arg @ref FL_TSI_IDAC1_MODE_MUTUAL_CAPACITANCE
  */
__STATIC_INLINE uint32_t FL_TSI_GetIDAC1Mode(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ANACR, TSI_ANACR_IDAC1_MODE_CTRL_Msk));
}

/**
  * @brief    
  * @rmtoll   ANACR    IDAC2_DOUBLE    FL_TSI_EnableIDAC2Double
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableIDAC2Double(TSI_Type *TSIx)
{
    SET_BIT(TSIx->ANACR, TSI_ANACR_IDAC2_DOUBLE_Msk);
}

/**
  * @brief    
  * @rmtoll   ANACR    IDAC2_DOUBLE    FL_TSI_DisableIDAC2Double
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableIDAC2Double(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->ANACR, TSI_ANACR_IDAC2_DOUBLE_Msk);
}

/**
  * @brief    
  * @rmtoll   ANACR    IDAC2_DOUBLE    FL_TSI_IsEnabledIDAC2Double
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledIDAC2Double(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ANACR, TSI_ANACR_IDAC2_DOUBLE_Msk) == TSI_ANACR_IDAC2_DOUBLE_Msk);
}

/**
  * @brief    
  * @rmtoll   ANACR    IDAC1_DOUBLE    FL_TSI_EnableIDAC1Double
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableIDAC1Double(TSI_Type *TSIx)
{
    SET_BIT(TSIx->ANACR, TSI_ANACR_IDAC1_DOUBLE_Msk);
}

/**
  * @brief    
  * @rmtoll   ANACR    IDAC1_DOUBLE    FL_TSI_DisableIDAC1Double
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableIDAC1Double(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->ANACR, TSI_ANACR_IDAC1_DOUBLE_Msk);
}

/**
  * @brief    
  * @rmtoll   ANACR    IDAC1_DOUBLE    FL_TSI_IsEnabledIDAC1Double
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledIDAC1Double(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ANACR, TSI_ANACR_IDAC1_DOUBLE_Msk) == TSI_ANACR_IDAC1_DOUBLE_Msk);
}

/**
  * @brief    
  * @rmtoll   ANACR    IDAC2_RANGET    FL_TSI_SetIDAC2Step
  * @param    TSIx TSI instance
  * @param    STEP This parameter can be one of the following values:
  *           @arg @ref FL_TSI_IDAC2_STEP_2P4uA
  *           @arg @ref FL_TSI_IDAC2_STEP_1P2uA
  *           @arg @ref FL_TSI_IDAC2_STEP_300nA
  *           @arg @ref FL_TSI_IDAC2_STEP_37P5nA
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetIDAC2Step(TSI_Type *TSIx, uint32_t step)
{
    MODIFY_REG(TSIx->ANACR, TSI_ANACR_IDAC2_RANGET_Msk, step);
}

/**
  * @brief    
  * @rmtoll   ANACR    IDAC2_RANGET    FL_TSI_GetIDAC2Step
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_TSI_IDAC2_STEP_2P4uA
  *           @arg @ref FL_TSI_IDAC2_STEP_1P2uA
  *           @arg @ref FL_TSI_IDAC2_STEP_300nA
  *           @arg @ref FL_TSI_IDAC2_STEP_37P5nA
  */
__STATIC_INLINE uint32_t FL_TSI_GetIDAC2Step(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ANACR, TSI_ANACR_IDAC2_RANGET_Msk));
}

/**
  * @brief    
  * @rmtoll   ANACR    IDAC1_RANGET    FL_TSI_SetIDAC1Step
  * @param    TSIx TSI instance
  * @param    Step This parameter can be one of the following values:
  *           @arg @ref FL_TSI_IDAC1_STEP_2P4uA
  *           @arg @ref FL_TSI_IDAC1_STEP_1P2uA
  *           @arg @ref FL_TSI_IDAC1_STEP_300nA
  *           @arg @ref FL_TSI_IDAC1_STEP_37P5nA
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetIDAC1Step(TSI_Type *TSIx, uint32_t step)
{
    MODIFY_REG(TSIx->ANACR, TSI_ANACR_IDAC1_RANGET_Msk, step);
}

/**
  * @brief    
  * @rmtoll   ANACR    IDAC1_RANGET    FL_TSI_GetIDAC1Step
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_TSI_IDAC1_GEAR_2P4uA
  *           @arg @ref FL_TSI_IDAC1_GEAR_1P2uA
  *           @arg @ref FL_TSI_IDAC1_GEAR_300nA
  *           @arg @ref FL_TSI_IDAC1_GEAR_37P5nA
  */
__STATIC_INLINE uint32_t FL_TSI_GetIDAC1Step(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ANACR, TSI_ANACR_IDAC1_RANGET_Msk));
}

/**
  * @brief    
  * @rmtoll   ANACR    SHIELD_MOD    FL_TSI_SetShieldMode
  * @param    TSIx TSI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_TSI_SHIELD_MOD_454
  *           @arg @ref FL_TSI_SHIELD_MOD_INTERBUFFER
  *           @arg @ref FL_TSI_SHIELD_MOD_EXTERCAPACITORS
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetShieldMode(TSI_Type *TSIx, uint32_t mode)
{
    MODIFY_REG(TSIx->ANACR, TSI_ANACR_SHIELD_MOD_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   ANACR    SHIELD_MOD    FL_TSI_GetShieldMode
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_TSI_SHIELD_MOD_454
  *           @arg @ref FL_TSI_SHIELD_MOD_INTERBUFFER
  *           @arg @ref FL_TSI_SHIELD_MOD_EXTERCAPACITORS
  */
__STATIC_INLINE uint32_t FL_TSI_GetShieldMode(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ANACR, TSI_ANACR_SHIELD_MOD_Msk));
}

/**
  * @brief    
  * @rmtoll   TEST    SENSE_CFG    FL_TSI_SetSensitivityTestGear
  * @param    TSIx TSI instance
  * @param    gear This parameter can be one of the following values:
  *           @arg @ref FL_TSI_SENSE_CFG_INVALID
  *           @arg @ref FL_TSI_SENSE_CFG_0P1pF
  *           @arg @ref FL_TSI_SENSE_CFG_0P2pF
  *           @arg @ref FL_TSI_SENSE_CFG_0P3pF
  *           @arg @ref FL_TSI_SENSE_CFG_0P4pF
  *           @arg @ref FL_TSI_SENSE_CFG_0P5pF
  *           @arg @ref FL_TSI_SENSE_CFG_0P6pF
  *           @arg @ref FL_TSI_SENSE_CFG_0P7pF
  *           @arg @ref FL_TSI_SENSE_CFG_0P8pF
  *           @arg @ref FL_TSI_SENSE_CFG_0P9pF
  *           @arg @ref FL_TSI_SENSE_CFG_1P0pF
  *           @arg @ref FL_TSI_SENSE_CFG_1P1pF
  *           @arg @ref FL_TSI_SENSE_CFG_1P2pF
  *           @arg @ref FL_TSI_SENSE_CFG_1P3pF
  *           @arg @ref FL_TSI_SENSE_CFG_1P4pF
  *           @arg @ref FL_TSI_SENSE_CFG_1P5pF
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetSensitivityTestGear(TSI_Type *TSIx, uint32_t gear)
{
    MODIFY_REG(TSIx->TEST, TSI_TEST_SENSE_CFG_Msk, gear);
}

/**
  * @brief    
  * @rmtoll   TEST    SENSE_CFG    FL_TSI_GetSensitivityTestGear
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_TSI_SENSE_CFG_INVALID
  *           @arg @ref FL_TSI_SENSE_CFG_0P1pF
  *           @arg @ref FL_TSI_SENSE_CFG_0P2pF
  *           @arg @ref FL_TSI_SENSE_CFG_0P3pF
  *           @arg @ref FL_TSI_SENSE_CFG_0P4pF
  *           @arg @ref FL_TSI_SENSE_CFG_0P5pF
  *           @arg @ref FL_TSI_SENSE_CFG_0P6pF
  *           @arg @ref FL_TSI_SENSE_CFG_0P7pF
  *           @arg @ref FL_TSI_SENSE_CFG_0P8pF
  *           @arg @ref FL_TSI_SENSE_CFG_0P9pF
  *           @arg @ref FL_TSI_SENSE_CFG_1P0pF
  *           @arg @ref FL_TSI_SENSE_CFG_1P1pF
  *           @arg @ref FL_TSI_SENSE_CFG_1P2pF
  *           @arg @ref FL_TSI_SENSE_CFG_1P3pF
  *           @arg @ref FL_TSI_SENSE_CFG_1P4pF
  *           @arg @ref FL_TSI_SENSE_CFG_1P5pF
  */
__STATIC_INLINE uint32_t FL_TSI_GetSensitivityTestGear(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->TEST, TSI_TEST_SENSE_CFG_Msk));
}

/**
  * @brief    
  * @rmtoll   TEST    CH_IDLE_CFG    FL_TSI_SetInactiveSensorConnection
  * @param    TSIx TSI instance
  * @param    connection This parameter can be one of the following values:
  *           @arg @ref FL_TSI_CH_IDLE_CFG_FLOAT
  *           @arg @ref FL_TSI_CH_IDLE_CFG_GROUND
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetInactiveSensorConnection(TSI_Type *TSIx, uint32_t connection)
{
    MODIFY_REG(TSIx->TEST, TSI_TEST_CH_IDLE_CFG_Msk, connection);
}

/**
  * @brief    
  * @rmtoll   TEST    CH_IDLE_CFG    FL_TSI_GetInactiveSensorConnection
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_TSI_CH_IDLE_CFG_FLOAT
  *           @arg @ref FL_TSI_CH_IDLE_CFG_GROUND
  */
__STATIC_INLINE uint32_t FL_TSI_GetInactiveSensorConnection(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->TEST, TSI_TEST_CH_IDLE_CFG_Msk));
}

/**
  * @brief    
  * @rmtoll   TEST    R2D_CFG    FL_TSI_SetGroundedResisance
  * @param    TSIx TSI instance
  * @param    gear This parameter can be one of the following values:
  *           @arg @ref FL_TSI_R2D_CFG_100K
  *           @arg @ref FL_TSI_R2D_CFG_150K
  *           @arg @ref FL_TSI_R2D_CFG_200K
  *           @arg @ref FL_TSI_R2D_CFG_250K
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetGroundedResisance(TSI_Type *TSIx, uint32_t value)
{
    MODIFY_REG(TSIx->TEST, TSI_TEST_R2D_CFG_Msk, value);
}

/**
  * @brief    
  * @rmtoll   TEST    R2D_CFG    FL_TSI_GetGroundedResisance
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_TSI_R2D_CFG_100K
  *           @arg @ref FL_TSI_R2D_CFG_150K
  *           @arg @ref FL_TSI_R2D_CFG_200K
  *           @arg @ref FL_TSI_R2D_CFG_250K
  */
__STATIC_INLINE uint32_t FL_TSI_GetGroundedResisance(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->TEST, TSI_TEST_R2D_CFG_Msk));
}

/**
  * @brief    
  * @rmtoll   TEST    SENSI_VALID    FL_TSI_SetTestRingConnection
  * @param    TSIx TSI instance
  * @param    connection This parameter can be one of the following values:
  *           @arg @ref FL_TSI_TST_CONN_RESISTANCE
  *           @arg @ref FL_TSI_TST_CONN_CAPARRAY
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetTestRingConnection(TSI_Type *TSIx, uint32_t connection)
{
    MODIFY_REG(TSIx->TEST, TSI_TEST_SENSI_VALID_Msk, connection);
}

/**
  * @brief    
  * @rmtoll   TEST    SENSI_VALID    FL_TSI_GetTestRingConnection
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_TSI_TST_CONN_RESISTANCE
  *           @arg @ref FL_TSI_TST_CONN_CAPARRAY
  */
__STATIC_INLINE uint32_t FL_TSI_GetTestRingConnection(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->TEST, TSI_TEST_SENSI_VALID_Msk));
}

/**
  * @brief    
  * @rmtoll   ANATEST    VCOMP_DFLT    FL_TSI_WriteCompFeedbackDelay
  * @param    TSIx TSI instance
  * @param    width 
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_WriteCompFeedbackDelay(TSI_Type *TSIx, uint32_t width)
{
    MODIFY_REG(TSIx->ANATEST, (0xffU << 16U), (width << 16U));
}

/**
  * @brief    
  * @rmtoll   ANATEST    VCOMP_DFLT    FL_TSI_ReadCompFeedbackDelay
  * @param    TSIx TSI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_TSI_ReadCompFeedbackDelay(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ANATEST, (0xffU << 16U)) >> 16U);
}

/**
  * @brief    
  * @rmtoll   ANATEST    VCOMP_DFEN    FL_TSI_EnableCompFeedbackFilter
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableCompFeedbackFilter(TSI_Type *TSIx)
{
    SET_BIT(TSIx->ANATEST, TSI_ANATEST_VCOMP_DFEN_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    VCOMP_DFEN    FL_TSI_DisableCompFeedbackFilter
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableCompFeedbackFilter(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->ANATEST, TSI_ANATEST_VCOMP_DFEN_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    VCOMP_DFEN    FL_TSI_IsEnabledCompFeedbackFilter
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledCompFeedbackFilter(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ANATEST, TSI_ANATEST_VCOMP_DFEN_Msk) == TSI_ANATEST_VCOMP_DFEN_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    IDAC1_CHG_SWT    FL_TSI_EnableIdac1ChargeExtCap
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableIdac1ChargeExtCap(TSI_Type *TSIx)
{
    SET_BIT(TSIx->ANATEST, TSI_ANATEST_IDAC1_CHG_SWT_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    IDAC1_CHG_SWT    FL_TSI_DisableIdac1ChargeExtCap
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableIdac1ChargeExtCap(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->ANATEST, TSI_ANATEST_IDAC1_CHG_SWT_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    IDAC1_CHG_SWT    FL_TSI_IsEnabledIdac1ChargeExtCap
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledIdac1ChargeExtCap(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ANATEST, TSI_ANATEST_IDAC1_CHG_SWT_Msk) == TSI_ANATEST_IDAC1_CHG_SWT_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    EXCAP_SEL    FL_TSI_SetExtCapForTest
  * @param    TSIx TSI instance
  * @param    capacitance This parameter can be one of the following values:
  *           @arg @ref FL_TSI_EXCAP_SEL_CINTA
  *           @arg @ref FL_TSI_EXCAP_SEL_CINTB
  *           @arg @ref FL_TSI_EXCAP_SEL_CTANK
  *           @arg @ref FL_TSI_EXCAP_SEL_CMOD
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetExtCapForTest(TSI_Type *TSIx, uint32_t capacitance)
{
    MODIFY_REG(TSIx->ANATEST, TSI_ANATEST_EXCAP_SEL_Msk, capacitance);
}

/**
  * @brief    
  * @rmtoll   ANATEST    EXCAP_SEL    FL_TSI_GetExtCapForTest
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_TSI_EXCAP_SEL_CINTA
  *           @arg @ref FL_TSI_EXCAP_SEL_CINTB
  *           @arg @ref FL_TSI_EXCAP_SEL_CTANK
  *           @arg @ref FL_TSI_EXCAP_SEL_CMOD
  */
__STATIC_INLINE uint32_t FL_TSI_GetExtCapForTest(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ANATEST, TSI_ANATEST_EXCAP_SEL_Msk));
}

/**
  * @brief    
  * @rmtoll   ANATEST    EXCAP_TESTEN    FL_TSI_EnableTestExtCap
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableTestExtCap(TSI_Type *TSIx)
{
    SET_BIT(TSIx->ANATEST, TSI_ANATEST_EXCAP_TESTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    EXCAP_TESTEN    FL_TSI_DisableTestExtCap
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableTestExtCap(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->ANATEST, TSI_ANATEST_EXCAP_TESTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    EXCAP_TESTEN    FL_TSI_IsEnabledTestExtCap
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledTestExtCap(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ANATEST, TSI_ANATEST_EXCAP_TESTEN_Msk) == TSI_ANATEST_EXCAP_TESTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    BIIAS_OUTEN    FL_TSI_EnableIdac1TestOutput
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableIdac1TestOutput(TSI_Type *TSIx)
{
    SET_BIT(TSIx->ANATEST, TSI_ANATEST_BIIAS_OUTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    BIIAS_OUTEN    FL_TSI_DisableIdac1TestOutput
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableIdac1TestOutput(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->ANATEST, TSI_ANATEST_BIIAS_OUTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    BIIAS_OUTEN    FL_TSI_IsEnabledIdac1TestOutput
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledIdac1TestOutput(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ANATEST, TSI_ANATEST_BIIAS_OUTEN_Msk) == TSI_ANATEST_BIIAS_OUTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   VREFCRTEST    VREF_CSDCMP_TRIM    FL_TSI_WriteVerfCsdCmpTrim
  * @param    TSIx TSI instance
  * @param    trim 
  * @retval   None
  */

/**
  * @brief    
  * @rmtoll   ANATEST    VCOMP_FB    FL_TSI_SetCompFeedbackSyncEdges
  * @param    TSIx TSI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_TSI_VCOMP_FB_RISINGEDGE
  *           @arg @ref FL_TSI_VCOMP_FB_FALLINGEDGE
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetCompFeedbackSyncEdges(TSI_Type *TSIx, uint32_t mode)
{
    MODIFY_REG(TSIx->ANATEST, TSI_ANATEST_VCOMP_FB_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   ANATEST    VCOMP_FB    FL_TSI_GetCompFeedbackSyncEdges
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_TSI_VCOMP_FB_RISINGEDGE
  *           @arg @ref FL_TSI_VCOMP_FB_FALLINGEDGE
  */
__STATIC_INLINE uint32_t FL_TSI_GetCompFeedbackSyncEdges(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ANATEST, TSI_ANATEST_VCOMP_FB_Msk));
}

/**
  * @brief    
  * @rmtoll   ANATEST    IDAC_COMP_MODE    FL_TSI_SetIdac2CompensateMode
  * @param    TSIx TSI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_TSI_IDAC_COMP_MODE_NORMALLYOPEN
  *           @arg @ref FL_TSI_IDAC_COMP_MODE_COMPLEMENTATION
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetIdac2CompensateMode(TSI_Type *TSIx, uint32_t mode)
{
    MODIFY_REG(TSIx->ANATEST, TSI_ANATEST_IDAC_COMP_MODE_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   ANATEST    IDAC_COMP_MODE    FL_TSI_GetIdac2CompensateMode
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_TSI_IDAC_COMP_MODE_NORMALLYOPEN
  *           @arg @ref FL_TSI_IDAC_COMP_MODE_COMPLEMENTATION
  */
__STATIC_INLINE uint32_t FL_TSI_GetIdac2CompensateMode(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ANATEST, TSI_ANATEST_IDAC_COMP_MODE_Msk));
}

/**
  * @brief    
  * @rmtoll   ANATEST    VREF_BUF_ENT    FL_TSI_EnableVrefBufferEnt
  * @param    TSIx TSI instance
  * @param    mode This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableVrefBufferEnt(TSI_Type *TSIx)
{
    SET_BIT(TSIx->ANATEST, TSI_ANATEST_VREF_BUF_ENT_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    VREF_BUF_ENT    FL_TSI_DisableVrefBufferEnt
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE void FL_TSI_DisableVrefBufferEnt(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->ANATEST, TSI_ANATEST_VREF_BUF_ENT_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    COMP_ENT    FL_TSI_EnableCompEnt
  * @param    TSIx TSI instance
  * @param    mode This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableCompEnt(TSI_Type *TSIx)
{
    SET_BIT(TSIx->ANATEST, TSI_ANATEST_COMP_ENT_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    COMP_ENT    FL_TSI_DisableCompEnt
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE void FL_TSI_DisableCompEnt(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->ANATEST, TSI_ANATEST_COMP_ENT_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    IDAC2_ENT    FL_TSI_EnableIdac2Ent
  * @param    TSIx TSI instance
  * @param    mode This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableIdac2Ent(TSI_Type *TSIx)
{
    SET_BIT(TSIx->ANATEST, TSI_ANATEST_IDAC2_ENT_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    IDAC2_ENT    FL_TSI_DisableIdac2Ent
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE void FL_TSI_DisableIdac2Ent(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->ANATEST, TSI_ANATEST_IDAC2_ENT_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    IDAC1_ENT    FL_TSI_EnableIdac1Ent
  * @param    TSIx TSI instance
  * @param    mode This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableIdac1Ent(TSI_Type *TSIx)
{
    SET_BIT(TSIx->ANATEST, TSI_ANATEST_IDAC1_ENT_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    IDAC1_ENT    FL_TSI_DisableIdac1Ent
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE void FL_TSI_DisableIdac1Ent(TSI_Type *TSIx)
{
   CLEAR_BIT(TSIx->ANATEST, TSI_ANATEST_IDAC1_ENT_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    SIGMA_DELTA_ENT    FL_TSI_EnableSigmaDeltaEnt
  * @param    TSIx TSI instance
  * @param    mode This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableSigmaDeltaEnt(TSI_Type *TSIx)
{
    SET_BIT(TSIx->ANATEST, TSI_ANATEST_SIGMA_DELTA_ENT_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    SIGMA_DELTA_ENT    FL_TSI_DisableSigmaDeltaEnt
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE void FL_TSI_DisableSigmaDeltaEnt(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->ANATEST, TSI_ANATEST_SIGMA_DELTA_ENT_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    DEBUG_MODE    FL_TSI_EnableDebugMode
  * @param    TSIx TSI instance
  * @param    mode This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableDebugMode(TSI_Type *TSIx)
{
    SET_BIT(TSIx->ANATEST, TSI_ANATEST_DEBUG_MODE_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    DEBUG_MODE    FL_TSI_DisableDebugMode
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE void FL_TSI_DisableDebugMode(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->ANATEST, TSI_ANATEST_DEBUG_MODE_Msk);
}

/**
  * @brief    
  * @rmtoll   VREFCRTEST    REF_SEL    FL_TSI_SetVoltageReference
  * @param    TSIx TSI instance
  * @param    signal This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetVoltageReference(TSI_Type *TSIx, uint32_t signal)
{
    MODIFY_REG(TSIx->VREFCR, TSI_VREFCRTEST_REF_SEL_Msk, signal);
}

/**
  * @brief    
  * @rmtoll   VREFCRTEST    LOWREF_SEL    FL_TSI_GetLowVoltageReference
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_TSI_GetVoltageReference(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->VREFCR, TSI_VREFCRTEST_REF_SEL_Msk));
}

